open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
/****************************************************************************
 * board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
 *
 * NuttX audio lower-half for the BK7258 internal analog audio block.
 *
 * Two independent instances are created: a playback instance driving the
 * mono DAC (which reaches the speaker through the HT6872 amplifier) and,
 * when CONFIG_BK7258_AUDIO_CAPTURE is set, a capture instance reading the
 * analog MIC ADC.
 *
 * Data movement is interrupt-driven FIFO copy.  The chip's DMA engine is
 * not used yet: bk7258_dma.c currently exposes a single-instance
 * memory-to-memory channel (bk7258_dma_configure/start/stop with no
 * channel argument), so a peripheral-destination circular channel has to
 * be added there before playback can be handed to DMA.  At 16 kHz mono
 * the FIFO path is affordable; it will not be at 48 kHz stereo.
 *
 * Buffer completion is reported from a high-priority work queue rather
 * than directly from the ISR, because the upper half's dequeue path ends
 * in a message-queue send.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <debug.h>
#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/audio/audio.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/queue.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/wqueue.h>

#include "bk7258_aud.h"
#include "bk7258_audio_bringup.h"

#ifdef CONFIG_BK7258_AUDIO

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_BK7258_AUDIO_SAMPLERATE
#  define CONFIG_BK7258_AUDIO_SAMPLERATE 16000
#endif

#ifndef CONFIG_BK7258_AUDIO_PA_ON_DELAY_MS
#  define CONFIG_BK7258_AUDIO_PA_ON_DELAY_MS 20
#endif

#ifndef CONFIG_BK7258_AUDIO_PA_OFF_DELAY_MS
#  define CONFIG_BK7258_AUDIO_PA_OFF_DELAY_MS 10
#endif

/* Number of samples copied per ISR visit before giving the FIFO status
 * another look.  Bounds the time spent in interrupt context.
 */

#define BK7258_AUDIO_ISR_BUDGET   64

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_audio_s
{
  /* This field must appear first so the structure can be cast to
   * struct audio_lowerhalf_s.
   */

  struct audio_lowerhalf_s dev;

  bool playback;                     /* true: DAC, false: ADC          */
  bool configured;
  bool running;
  bool paused;

  struct bk7258_aud_config cfg;

  /* Buffers handed down by the upper half but not yet fully consumed or
   * filled, and buffers finished by the ISR and awaiting the completion
   * callback.
   */

  struct dq_queue_s pendq;
  struct dq_queue_s doneq;

  struct work_s work;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_audio_getcaps(FAR struct audio_lowerhalf_s *dev, int type,
                                FAR struct audio_caps_s *caps);
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_configure(FAR struct audio_lowerhalf_s *dev,
                                  FAR void *session,
                                  FAR const struct audio_caps_s *caps);
#else
static int bk7258_audio_configure(FAR struct audio_lowerhalf_s *dev,
                                  FAR const struct audio_caps_s *caps);
#endif
static int bk7258_audio_shutdown(FAR struct audio_lowerhalf_s *dev);
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_start(FAR struct audio_lowerhalf_s *dev,
                              FAR void *session);
#else
static int bk7258_audio_start(FAR struct audio_lowerhalf_s *dev);
#endif
#ifndef CONFIG_AUDIO_EXCLUDE_STOP
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_stop(FAR struct audio_lowerhalf_s *dev,
                             FAR void *session);
#else
static int bk7258_audio_stop(FAR struct audio_lowerhalf_s *dev);
#endif
#endif
#ifndef CONFIG_AUDIO_EXCLUDE_PAUSE_RESUME
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_pause(FAR struct audio_lowerhalf_s *dev,
                              FAR void *session);
static int bk7258_audio_resume(FAR struct audio_lowerhalf_s *dev,
                               FAR void *session);
#else
static int bk7258_audio_pause(FAR struct audio_lowerhalf_s *dev);
static int bk7258_audio_resume(FAR struct audio_lowerhalf_s *dev);
#endif
#endif
static int bk7258_audio_enqueuebuffer(FAR struct audio_lowerhalf_s *dev,
                                      FAR struct ap_buffer_s *apb);
static int bk7258_audio_cancelbuffer(FAR struct audio_lowerhalf_s *dev,
                                     FAR struct ap_buffer_s *apb);
static int bk7258_audio_ioctl(FAR struct audio_lowerhalf_s *dev, int cmd,
                              unsigned long arg);
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_reserve(FAR struct audio_lowerhalf_s *dev,
                                FAR void **session);
static int bk7258_audio_release(FAR struct audio_lowerhalf_s *dev,
                                FAR void *session);
#else
static int bk7258_audio_reserve(FAR struct audio_lowerhalf_s *dev);
static int bk7258_audio_release(FAR struct audio_lowerhalf_s *dev);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct audio_ops_s g_bk7258_audio_ops =
{
  bk7258_audio_getcaps,       /* getcaps        */
  bk7258_audio_configure,     /* configure      */
  bk7258_audio_shutdown,      /* shutdown       */
  bk7258_audio_start,         /* start          */
#ifndef CONFIG_AUDIO_EXCLUDE_STOP
  bk7258_audio_stop,          /* stop           */
#endif
#ifndef CONFIG_AUDIO_EXCLUDE_PAUSE_RESUME
  bk7258_audio_pause,         /* pause          */
  bk7258_audio_resume,        /* resume         */
#endif
  NULL,                       /* allocbuffer    */
  NULL,                       /* freebuffer     */
  bk7258_audio_enqueuebuffer, /* enqueue_buffer */
  bk7258_audio_cancelbuffer,  /* cancel_buffer  */
  bk7258_audio_ioctl,         /* ioctl          */
  NULL,                       /* read           */
  NULL,                       /* write          */
  bk7258_audio_reserve,       /* reserve        */
  bk7258_audio_release        /* release        */
};

/* The chip layer supports one DAC and one ADC, so a static instance per
 * direction is sufficient and avoids an allocation on the bring-up path.
 */

static struct bk7258_audio_s g_bk7258_playback;
#ifdef CONFIG_BK7258_AUDIO_CAPTURE
static struct bk7258_audio_s g_bk7258_capture;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_audio_complete_work
 *
 * Description:
 *   Work-queue half of buffer completion.  Drains doneq and reports each
 *   buffer to the upper half.
 *
 ****************************************************************************/

static void bk7258_audio_complete_work(FAR void *arg)
{
  FAR struct bk7258_audio_s *priv = arg;
  FAR struct ap_buffer_s *apb;
  irqstate_t flags;

