open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
  for (; ; )
    {
      flags = enter_critical_section();
      apb = (FAR struct ap_buffer_s *)dq_remfirst(&priv->doneq);
      leave_critical_section(flags);

      if (apb == NULL)
        {
          break;
        }

#ifdef CONFIG_AUDIO_MULTI_SESSION
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK,
                      NULL);
#else
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK);
#endif
    }
}

/****************************************************************************
 * Name: bk7258_audio_finish
 *
 * Description:
 *   Move a finished buffer to doneq and schedule the completion work.
 *   Called from interrupt context.
 *
 ****************************************************************************/

static void bk7258_audio_finish(FAR struct bk7258_audio_s *priv,
                                FAR struct ap_buffer_s *apb)
{
  dq_addlast(&apb->dq_entry, &priv->doneq);

  if (work_available(&priv->work))
    {
      work_queue(HPWORK, &priv->work, bk7258_audio_complete_work, priv, 0);
    }
}

/****************************************************************************
 * Name: bk7258_audio_tx_callback
 *
 * Description:
 *   DAC FIFO service, invoked from the AUD ISR when the left FIFO has
 *   drained below its read threshold.
 *
 ****************************************************************************/

static void bk7258_audio_tx_callback(void *arg)
{
  FAR struct bk7258_audio_s *priv = arg;
  FAR struct ap_buffer_s *apb;
  unsigned int budget = BK7258_AUDIO_ISR_BUDGET;

  while (budget > 0)
    {
      apb = (FAR struct ap_buffer_s *)dq_peek(&priv->pendq);
      if (apb == NULL)
        {
          /* Nothing left to play.  Mask the interrupt so the ISR does not
           * spin on a permanently-empty FIFO; enqueuebuffer() re-arms it.
           */

          bk7258_aud_tx_int_enable(false);
          return;
        }

      if (apb->curbyte + sizeof(int16_t) <= apb->nbytes)
        {
          FAR const int16_t *samples =
            (FAR const int16_t *)(apb->samp + apb->curbyte);
          unsigned int avail = (apb->nbytes - apb->curbyte) /
                               sizeof(int16_t);
          unsigned int written;

          if (avail > budget)
            {
              avail = budget;
            }

          written = bk7258_aud_dac_write(samples, avail);
          apb->curbyte += written * sizeof(int16_t);
          budget -= written;

          if (written < avail)
            {
              /* FIFO is full: come back on the next interrupt. */

              return;
            }
        }
      else
        {
          /* Buffer exhausted (this also covers a zero-length buffer, which
           * the upper half uses to mark end of stream).
           */

          (void)dq_remfirst(&priv->pendq);
          bk7258_audio_finish(priv, apb);
        }
    }
}

/****************************************************************************
 * Name: bk7258_audio_rx_callback
 *
 * Description:
 *   ADC FIFO service, invoked from the AUD ISR when the FIFO has risen
 *   above its write threshold.
 *
 ****************************************************************************/

#ifdef CONFIG_BK7258_AUDIO_CAPTURE
static void bk7258_audio_rx_callback(void *arg)
{
  FAR struct bk7258_audio_s *priv = arg;
  FAR struct ap_buffer_s *apb;
  unsigned int budget = BK7258_AUDIO_ISR_BUDGET;

  while (budget > 0)
    {
      apb = (FAR struct ap_buffer_s *)dq_peek(&priv->pendq);
      if (apb == NULL)
        {
          /* No buffer to fill.  Drop the interrupt rather than spinning;
           * the samples still in the FIFO are lost, which is the correct
           * behaviour for a capture overrun.
           */

          bk7258_aud_rx_int_enable(false);
          return;
        }

      if (apb->nbytes + sizeof(int16_t) <= apb->nmaxbytes)
        {
          FAR int16_t *samples = (FAR int16_t *)(apb->samp + apb->nbytes);
          unsigned int room = (apb->nmaxbytes - apb->nbytes) /
                              sizeof(int16_t);
          unsigned int read;

          if (room > budget)
            {
              room = budget;
            }

          read = bk7258_aud_adc_read(samples, room);
          apb->nbytes += read * sizeof(int16_t);
          budget -= read;

          if (read < room)
            {
              /* FIFO drained: wait for the next interrupt. */

              return;
            }
        }
      else
        {
          (void)dq_remfirst(&priv->pendq);
          bk7258_audio_finish(priv, apb);
        }
    }
}
#endif

/****************************************************************************
 * Name: bk7258_audio_flush
 *
 * Description:
 *   Return every queued buffer to the upper half.  Used by shutdown and
 *   stop so no buffer is stranded in the lower half.
 *
 ****************************************************************************/

static void bk7258_audio_flush(FAR struct bk7258_audio_s *priv)
{
  FAR struct ap_buffer_s *apb;
  irqstate_t flags;

  for (; ; )
    {
      flags = enter_critical_section();
      apb = (FAR struct ap_buffer_s *)dq_remfirst(&priv->pendq);
      leave_critical_section(flags);

      if (apb == NULL)
        {
          break;
        }

#ifdef CONFIG_AUDIO_MULTI_SESSION
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK,
                      NULL);
#else
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK);
#endif
    }

  bk7258_audio_complete_work(priv);
}

/****************************************************************************
 * Name: bk7258_audio_poll_adc
 *
 * Description:
 *   Diagnostic helper: drain the ADC FIFO by polling for roughly 200 ms,
 *   deliberately ignoring the interrupt path.  Returns the sample count and
 *   accumulates the sum of squares so the caller can report a mean square.
 *
 ****************************************************************************/

static unsigned int bk7258_audio_poll_adc(FAR uint64_t *sumsq)
{
  int16_t samples[32];
  unsigned int total = 0;
  unsigned int i;

  for (i = 0; i < 200; i++)
    {
      unsigned int got = bk7258_aud_adc_read(samples, 32);
      unsigned int j;

