open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
      for (j = 0; j < got; j++)
        {
          *sumsq += (uint64_t)((int32_t)samples[j] * (int32_t)samples[j]);
        }

      total += got;
      up_udelay(1000);
    }

  return total;
}

/****************************************************************************
 * Name: bk7258_audio_getcaps
 ****************************************************************************/

static int bk7258_audio_getcaps(FAR struct audio_lowerhalf_s *dev, int type,
                                FAR struct audio_caps_s *caps)
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

  (void)type;

  DEBUGASSERT(caps != NULL &&
              caps->ac_len >= sizeof(struct audio_caps_s));

  caps->ac_format.hw  = 0;
  caps->ac_controls.w = 0;

  switch (caps->ac_type)
    {
      case AUDIO_TYPE_QUERY:

        /* Playback is mono: the chip has no right DAC and the board has a
         * single speaker.  Capture reports two channels when the MIC2 echo
         * reference is enabled, because frames really are L/R interleaved
         * (L = voice, R = reference) even though only one of the two is a
         * microphone.
         */

        caps->ac_channels = priv->playback ? 1 :
                            (priv->cfg.capture_reference ? 2 : 1);

        switch (caps->ac_subtype)
          {
            case AUDIO_TYPE_QUERY:
              caps->ac_controls.b[0] = priv->playback ? AUDIO_TYPE_OUTPUT :
                                                        AUDIO_TYPE_INPUT;
              caps->ac_format.hw = 1 << (AUDIO_FMT_PCM - 1);
              break;

            default:
              caps->ac_controls.b[0] = AUDIO_SUBFMT_END;
              break;
          }
        break;

      case AUDIO_TYPE_OUTPUT:
      case AUDIO_TYPE_INPUT:
        caps->ac_channels = priv->playback ? 1 :
                            (priv->cfg.capture_reference ? 2 : 1);

        switch (caps->ac_subtype)
          {
            case AUDIO_TYPE_QUERY:

              /* Only the rates reachable from the 26 MHz crystal are
               * advertised.  The 44.1k/48k families additionally need the
               * APLL calibration sequence, which aud_clk_config() in
               * bk7258_aud.c deliberately rejects with -ENOTSUP until it
               * has been transcribed from the vendor tree.
               */

              caps->ac_controls.hw[0] = AUDIO_SAMP_RATE_8K |
                                        AUDIO_SAMP_RATE_16K |
                                        AUDIO_SAMP_RATE_32K;
              caps->ac_controls.b[2] = 16;   /* Bits per sample */
              break;

            default:
              break;
          }
        break;

      default:
        caps->ac_subtype = 0;
        caps->ac_channels = 0;
        break;
    }

  return caps->ac_len;
}

/****************************************************************************
 * Name: bk7258_audio_configure
 ****************************************************************************/

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_configure(FAR struct audio_lowerhalf_s *dev,
                                  FAR void *session,
                                  FAR const struct audio_caps_s *caps)
#else
static int bk7258_audio_configure(FAR struct audio_lowerhalf_s *dev,
                                  FAR const struct audio_caps_s *caps)
#endif
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;
  uint32_t samplerate;
  int ret;

#ifdef CONFIG_AUDIO_MULTI_SESSION
  (void)session;
#endif

  DEBUGASSERT(caps != NULL);

  switch (caps->ac_type)
    {
      case AUDIO_TYPE_OUTPUT:
      case AUDIO_TYPE_INPUT:
        if ((caps->ac_type == AUDIO_TYPE_OUTPUT) != priv->playback)
          {
            return -EINVAL;
          }

        /* Sample width.  The FIFO ports are 16 bits per sample and the
         * copy loops below step by sizeof(int16_t), so anything else would
         * be silently misinterpreted rather than merely sounding wrong.
         */

        if (caps->ac_controls.b[2] != 0 && caps->ac_controls.b[2] != 16)
          {
            auderr("unsupported sample width %u\n",
                   caps->ac_controls.b[2]);
            return -EINVAL;
          }

        /* Channel count.  Playback is mono because the chip has no right
         * DAC.  Capture is two channels when the MIC2 echo reference is
         * enabled and one otherwise; the count is a property of the
         * hardware wiring, not something the caller can choose.
         */

        if (caps->ac_channels != 0)
          {
            uint8_t expected = priv->playback ? 1 :
                               (priv->cfg.capture_reference ? 2 : 1);

            if (caps->ac_channels != expected)
              {
                auderr("unsupported channel count %u, expected %u\n",
                       caps->ac_channels, expected);
                return -EINVAL;
              }
          }

        /* nxplayer splits the sample rate across hw[0] and b[3] (see
         * nxplayer.c:1935-1936), so both halves have to be recombined.
         */

        samplerate = caps->ac_controls.hw[0] |
                     ((uint32_t)caps->ac_controls.b[3] << 16);
        if (samplerate != 0)
          {
            priv->cfg.samplerate = samplerate;
          }

        if (priv->playback)
          {
            ret = bk7258_aud_dac_setup(&priv->cfg);
          }
        else
          {
            ret = bk7258_aud_adc_setup(&priv->cfg);
          }

        if (ret < 0)
          {
            auderr("%s setup failed: %d\n",
                   priv->playback ? "DAC" : "ADC", ret);
            return ret;
          }

        priv->configured = true;
        break;

      case AUDIO_TYPE_FEATURE:

        /* Volume maps onto the DAC's digital gain.  The upper half passes
         * 0..1000; scale that onto 0..0x3f, whose 0 dB point is 0x2d.
         */

#ifndef CONFIG_AUDIO_EXCLUDE_VOLUME
        if (caps->ac_format.hw == AUDIO_FU_VOLUME && priv->playback)
          {
            uint16_t volume = caps->ac_controls.hw[0];
            uint8_t gain;

            if (volume > 1000)
              {
                volume = 1000;
              }

            gain = (uint8_t)((volume * BK7258_AUD_DAC_DIG_GAIN_MAX) / 1000);
            return bk7258_aud_dac_set_dig_gain(gain);
          }

#endif
        return -ENOTTY;

      default:
        return -ENOTTY;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_shutdown
 ****************************************************************************/

static int bk7258_audio_shutdown(FAR struct audio_lowerhalf_s *dev)
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

  if (priv->playback)
    {
      /* Amplifier first, DAC second: see bk7258_audio_stop(). */

      bk7258_aud_dac_mute(true);
      bk7258_audio_pa_enable(false);
      bk7258_aud_dac_shutdown();
    }
  else
    {
      bk7258_aud_adc_shutdown();
    }

  bk7258_audio_flush(priv);

  priv->configured = false;
  priv->running = false;
  priv->paused = false;

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_start
 *
 * Description:
 *   Playback start-up order follows the vendor's onboard_speaker_stream
 *   implementation (aud_dac start, pa_on_delay, amplifier on, un-mute):
 *   the amplifier stays muted while the DAC's analog output settles, so
 *   the speaker does not pop.  R71's 10K pull-down keeps CTRL low until
 *   bk7258_audio_pa_enable(true) drives it, which means the hardware is
 *   already silent before software gets here.
 *
 ****************************************************************************/

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_start(FAR struct audio_lowerhalf_s *dev,
                              FAR void *session)
#else
static int bk7258_audio_start(FAR struct audio_lowerhalf_s *dev)
#endif
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

#ifdef CONFIG_AUDIO_MULTI_SESSION
  (void)session;
#endif

  if (!priv->configured)
    {
      return -EPERM;
    }

  if (priv->running)
    {
      return OK;
    }

  if (priv->playback)
    {
      bk7258_aud_set_tx_callback(bk7258_audio_tx_callback, priv);
      bk7258_aud_dac_start();

      nxsig_usleep(CONFIG_BK7258_AUDIO_PA_ON_DELAY_MS * 1000);

