open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
      bk7258_audio_pa_enable(true);
      bk7258_aud_dac_mute(false);

      bk7258_aud_tx_int_enable(true);
    }
#ifdef CONFIG_BK7258_AUDIO_CAPTURE
  else
    {
      bk7258_aud_set_rx_callback(bk7258_audio_rx_callback, priv);
      bk7258_aud_adc_start();
      bk7258_aud_rx_int_enable(true);
    }
#endif

  priv->running = true;
  priv->paused = false;

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_stop
 *
 * Description:
 *   Teardown order is the inverse and is deliberately mute-first.  Note
 *   the vendor's own header and code disagree about where pa_off_delay
 *   sits: onboard_speaker_stream.h:51 describes it as the delay *after*
 *   turning the amplifier off, while onboard_speaker_stream.c:341-345
 *   sleeps *before* pulling the GPIO low.  The code order is the one that
 *   actually lets the analog output settle while still muted, so that is
 *   what is implemented here.
 *
 ****************************************************************************/

#ifndef CONFIG_AUDIO_EXCLUDE_STOP
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_stop(FAR struct audio_lowerhalf_s *dev,
                             FAR void *session)
#else
static int bk7258_audio_stop(FAR struct audio_lowerhalf_s *dev)
#endif
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

#ifdef CONFIG_AUDIO_MULTI_SESSION
  (void)session;
#endif

  if (priv->playback)
    {
      bk7258_aud_tx_int_enable(false);

      bk7258_aud_dac_mute(true);
      nxsig_usleep(CONFIG_BK7258_AUDIO_PA_OFF_DELAY_MS * 1000);
      bk7258_audio_pa_enable(false);

      bk7258_aud_dac_stop();
    }
  else
    {
      bk7258_aud_rx_int_enable(false);
      bk7258_aud_adc_stop();
    }

  if (priv->playback)
    {
      bk7258_aud_set_tx_callback(NULL, NULL);
    }
  else
    {
      bk7258_aud_set_rx_callback(NULL, NULL);
    }

  priv->running = false;
  priv->paused = false;

  bk7258_audio_flush(priv);

  return OK;
}
#endif

/****************************************************************************
 * Name: bk7258_audio_pause / bk7258_audio_resume
 *
 * Description:
 *   Pause only masks the FIFO interrupt and mutes; the DAC stays enabled
 *   and the amplifier stays on so resume is click-free.
 *
 ****************************************************************************/

#ifndef CONFIG_AUDIO_EXCLUDE_PAUSE_RESUME
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_pause(FAR struct audio_lowerhalf_s *dev,
                              FAR void *session)
#else
static int bk7258_audio_pause(FAR struct audio_lowerhalf_s *dev)
#endif
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

#ifdef CONFIG_AUDIO_MULTI_SESSION
  (void)session;
#endif

  if (!priv->running || priv->paused)
    {
      return OK;
    }

  if (priv->playback)
    {
      bk7258_aud_tx_int_enable(false);
      bk7258_aud_dac_mute(true);
    }
  else
    {
      bk7258_aud_rx_int_enable(false);
    }

  priv->paused = true;
  return OK;
}

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_resume(FAR struct audio_lowerhalf_s *dev,
                               FAR void *session)
#else
static int bk7258_audio_resume(FAR struct audio_lowerhalf_s *dev)
#endif
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

#ifdef CONFIG_AUDIO_MULTI_SESSION
  (void)session;
#endif

  if (!priv->running || !priv->paused)
    {
      return OK;
    }

  if (priv->playback)
    {
      bk7258_aud_dac_mute(false);
      bk7258_aud_tx_int_enable(true);
    }
  else
    {
      bk7258_aud_rx_int_enable(true);
    }

  priv->paused = false;
  return OK;
}
#endif

/****************************************************************************
 * Name: bk7258_audio_enqueuebuffer
 ****************************************************************************/

static int bk7258_audio_enqueuebuffer(FAR struct audio_lowerhalf_s *dev,
                                      FAR struct ap_buffer_s *apb)
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(apb != NULL);

  if (priv->playback)
    {
      apb->curbyte = 0;
    }
  else
    {
      apb->nbytes = 0;
    }

  flags = enter_critical_section();
  dq_addlast(&apb->dq_entry, &priv->pendq);
  leave_critical_section(flags);

  /* The ISR masks its own interrupt when it runs out of buffers, so
   * re-arm here rather than relying on it staying enabled.
   */

  if (priv->running && !priv->paused)
    {
      if (priv->playback)
        {
          bk7258_aud_tx_int_enable(true);
        }
      else
        {
          bk7258_aud_rx_int_enable(true);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_cancelbuffer
 ****************************************************************************/

static int bk7258_audio_cancelbuffer(FAR struct audio_lowerhalf_s *dev,
                                     FAR struct ap_buffer_s *apb)
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;
  irqstate_t flags;

  flags = enter_critical_section();
  dq_rem(&apb->dq_entry, &priv->pendq);
  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_ioctl
 ****************************************************************************/

static int bk7258_audio_ioctl(FAR struct audio_lowerhalf_s *dev, int cmd,
                              unsigned long arg)
{
  FAR struct bk7258_audio_s *priv = (FAR struct bk7258_audio_s *)dev;

  (void)priv;

  switch (cmd)
    {
      /* This must be answered unconditionally, and NOT hidden behind
       * CONFIG_AUDIO_DRIVER_SPECIFIC_BUFFERS.
       *
       * The upper half latches its buffer quota from this call:
       * audio.c:1267-1279 forwards GETBUFFERINFO to the lower half and only
       * assigns upper->nbuffers when the lower half returns >= 0.  If the
       * lower half answers -ENOTTY, upper->nbuffers stays 0, and then
       * audio_allocbuffer() (audio.c:786-789) short-circuits with
       * "return 0" on the very first AUDIOIOC_ALLOCBUFFER because
       * periods >= nbuffers already holds.  The application then cannot
       * obtain a single buffer, which is what "ALLOCBUFFER 0 failed: 0"
       * looked like on hardware.
       */

      case AUDIOIOC_GETBUFFERINFO:
        {
          FAR struct ap_buffer_info_s *bufinfo =
            (FAR struct ap_buffer_info_s *)arg;

          if (bufinfo == NULL)
            {
              return -EINVAL;
            }

          bufinfo->buffer_size = CONFIG_AUDIO_BUFFER_NUMBYTES;
          bufinfo->nbuffers    = CONFIG_AUDIO_NUM_BUFFERS;
        }
        break;

      /* Diagnostic: dump registers, then read the FIFO by polling so the
       * interrupt path is taken out of the picture entirely.
       */

      case BK7258_AUDIOIOC_DIAG:
        {
          unsigned int total = 0;
          uint64_t sumsq = 0;
          unsigned int i;

          syslog(LOG_INFO, "diag: %s, configured=%d running=%d "
                 "paused=%d rate=%" PRIu32 " ref=%d\n",
                 priv->playback ? "playback" : "capture",
                 priv->configured, priv->running, priv->paused,
                 priv->cfg.samplerate, priv->cfg.capture_reference);

          bk7258_aud_dump();

          if (!priv->playback)
            {
              bool forced;

              forced = bk7258_aud_force_module_clock();
              syslog(LOG_INFO, "diag: aud_cken was %s\n",
                     forced ? "CLEAR -> now set by AP" : "already set");

              /* Which MIC front end actually reaches the ADC?
               *
               * The ADC has been measured to deliver a single channel, so
               * the right half of every FIFO word is always zero and MIC2
               * never shows up in a normal capture.  Looking at MIC2 on
               * its own is the only way to tell whether the board's
               * post-amplifier echo tap (HT6872 OUT+/OUT- -> R84/R83 ->
               * C61/C60 -> MIC2P/MIC2N) carries signal at all, which is a
               * board-level question rather than a driver one.
               */

              bk7258_aud_select_mic(true, false);
              up_udelay(5000);
              sumsq = 0;
              total = bk7258_audio_poll_adc(&sumsq);
              syslog(LOG_INFO,
                     "diag: MIC1 only -> %u samples, meansq=%llu\n", total,
                     total ? (unsigned long long)(sumsq / total) : 0ull);

              bk7258_aud_select_mic(false, true);
              up_udelay(5000);
              sumsq = 0;
              total = bk7258_audio_poll_adc(&sumsq);
              syslog(LOG_INFO,
                     "diag: MIC2 only -> %u samples, meansq=%llu\n", total,
                     total ? (unsigned long long)(sumsq / total) : 0ull);

