open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/boards/bk7258/bk7258-ap/src/bk7258_audio_dev.c
              /* Leave MIC1 selected again. */

              bk7258_aud_select_mic(true, priv->cfg.capture_reference);

              /* AUD_CLK_CONTROL sweep.
               *
               * Only bit0 (ADC_SOFT_RESET) and bit1 (ADC_CLK_GATE) exist,
               * so all four combinations can simply be tried in order,
               * polling after each.  This settles by experiment what the
               * vendor sources describe inconsistently: whether bit0 is a
               * pulse that must be cleared (this driver's current
               * behaviour) or a release that must stay asserted (what
               * bk_aud_driver_init() actually leaves behind).
               */

              for (i = 0; i < 4; i++)
                {
                  bk7258_aud_set_clk_control(i);
                  up_udelay(2000);

                  sumsq = 0;
                  total = bk7258_audio_poll_adc(&sumsq);

                  syslog(LOG_INFO,
                         "diag: clkctl=0x%x (rst=%d gate=%d) -> %u samples,"
                         " meansq=%llu fifosta=0x%08" PRIx32 "\n",
                         i, i & 1, (i >> 1) & 1, total,
                         total ? (unsigned long long)(sumsq / total) : 0ull,
                         bk7258_aud_fifo_status());
                }
            }

          syslog(LOG_INFO, "diag: fifo status after poll=0x%08" PRIx32 "\n",
                 bk7258_aud_fifo_status());
        }
        break;

      default:
        (void)arg;
        return -ENOTTY;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_audio_reserve / bk7258_audio_release
 ****************************************************************************/

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_audio_reserve(FAR struct audio_lowerhalf_s *dev,
                                FAR void **session)
{
  (void)dev;

  if (session != NULL)
    {
      *session = NULL;
    }

  return OK;
}

static int bk7258_audio_release(FAR struct audio_lowerhalf_s *dev,
                                FAR void *session)
{
  (void)dev;
  (void)session;
  return OK;
}
#else
static int bk7258_audio_reserve(FAR struct audio_lowerhalf_s *dev)
{
  (void)dev;
  return OK;
}

static int bk7258_audio_release(FAR struct audio_lowerhalf_s *dev)
{
  (void)dev;
  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_audio_dev_initialize
 *
 * Description:
 *   Create one audio lower-half instance.  playback selects the DAC path;
 *   otherwise the ADC path is used.
 *
 ****************************************************************************/

FAR struct audio_lowerhalf_s *bk7258_audio_dev_initialize(bool playback)
{
  FAR struct bk7258_audio_s *priv;

  if (playback)
    {
      priv = &g_bk7258_playback;
    }
  else
    {
#ifdef CONFIG_BK7258_AUDIO_CAPTURE
      priv = &g_bk7258_capture;
#else
      return NULL;
#endif
    }

  memset(priv, 0, sizeof(*priv));

  priv->dev.ops = &g_bk7258_audio_ops;
  priv->playback = playback;

  dq_init(&priv->pendq);
  dq_init(&priv->doneq);

  priv->cfg.samplerate   = CONFIG_BK7258_AUDIO_SAMPLERATE;
  priv->cfg.clksrc       = BK7258_AUD_CLK_XTAL;
  priv->cfg.dac_dig_gain = BK7258_AUD_DAC_DIG_GAIN_0DB;
  priv->cfg.dac_ana_gain = BK7258_AUD_DAC_ANA_GAIN_DEF;
  priv->cfg.adc_gain     = BK7258_AUD_ADC_GAIN_0DB;
  priv->cfg.mic_gain     = BK7258_AUD_MIC_GAIN_DEF;

#if defined(CONFIG_BK7258_AUDIO_CAPTURE) && \
    defined(CONFIG_BK7258_AUDIO_AEC_REFERENCE)
  priv->cfg.capture_reference = !playback;
#else
  priv->cfg.capture_reference = false;
#endif

  return &priv->dev;
}

#endif /* CONFIG_BK7258_AUDIO */
